#+TITLE: Variant Calling with R/Bioconductor
#+AUTHOR: Michael Lawrence

#+OPTIONS: toc:t H:3

#+startup: beamer
#+LaTeX_CLASS: beamer

#+PROPERTY: exports both
#+PROPERTY: results none
#+PROPERTY: eval no-export
#+PROPERTY: session *R:VariantToolsTutorial*
#+PROPERTY: tangle yes

#+BEGIN_LaTeX
\AtBeginSubsection[]
{
  \begin{frame}<beamer>{Outline}
    \tableofcontents[currentsection,currentsubsection]
  \end{frame}
}
\AtBeginSection[]
{
  \begin{frame}<beamer>{Outline}
    \tableofcontents[currentsection]
  \end{frame}
}
#+END_LaTeX

*** Annotating the genotypes with merged variant calls
    # EXCERCISE?
    Annotate the genotypes for whether an alt allele was called in
    the merged data, and also add the alt and total depth:
    #+begin_src R :results replace
      softFilterMatrix(geno) <-
        cbind(in.merged = geno %in% merged.variants)
      mean(called(geno))
    #+end_src

    #+RESULTS:
    : 0.710044395116537

    #+begin_src R
      m <- match(geno, merged.tallies)
      altDepth(geno) <- naToZero(altDepth(merged.tallies)[m])
      totalDepth(geno) <- naToZero(totalDepth(merged.tallies)[m])
    #+end_src

*** False negatives: which filter to blame?
    Apply the calling filters to our FN and summarize the results:
    #+begin_src R :results value replace :colnames yes
      fn.geno <- geno[!called(geno)]
      fn.geno <- resetFilter(fn.geno)
      filters <- hardFilters(merged.variants)[3:4]
      fn.geno <- softFilter(fn.geno, filters)
      t(summary(softFilterMatrix(fn.geno)))
    #+end_src

    #+RESULTS:
    | <initial> | readCount | likelihoodRatio | <final> |
    |-----------+-----------+-----------------+---------|
    |      1021 |         0 |               9 |       0 |

    The default is to evaluate the filters in parallel, but serial
    evaluation is also supported:
    #+begin_src R :results value replace :colnames yes
      fn.geno <- resetFilter(fn.geno)
      fn.geno <- softFilter(fn.geno, filters, serial = TRUE)
      t(summary(softFilterMatrix(fn.geno)))
    #+end_src

    #+RESULTS:
    | <initial> | readCount | likelihoodRatio | <final> |
    |-----------+-----------+-----------------+---------|
    |      1021 |         0 |               0 |       0 |

*** dbSNP concordance
    Import a VRanges from (p53) dbSNP VCF:
    #+begin_src R
      vcfPath <- system.file("extdata", "dbsnp-p53.vcf.gz",
                             package = "VariantToolsData")
      param <- ScanVcfParam(fixed = "ALT", info = NA, geno = NA)
      dbSNP <- as(readVcf(vcfPath, param, genome = "TP53_demo"),
                  "VRanges")
      dbSNP <- dbSNP[!isIndel(dbSNP)]
    #+end_src

    And annotate the stacked variants for concordance:
    #+begin_src R :results value replace :colnames yes :rownames yes
      stacked.variants$dbSNP <- stacked.variants %in% dbSNP
      xtabs(~ dbSNP + expected.freq, mcols(stacked.variants))
    #+end_src

    #+RESULTS:
    |       |    0 | 0.25 |  0.5 | 0.75 |   1 |
    |-------+------+------+------+------+-----|
    | FALSE | 2233 |   25 |    0 |    0 |   0 |
    | TRUE  |  917 | 3497 | 2023 |  891 | 924 |

*** Replication over the samples
    Tabulate the stacked variants over the samples:
    #+begin_src R :results value replace :colnames yes :rownames yes
      tabulated.variants <- tabulate(stacked.variants)
      xtabs(~ dbSNP + sample.count, mcols(tabulated.variants))
    #+end_src

    #+RESULTS:
    |       |    1 |   2 |    3 |
    |-------+------+-----+------|
    | FALSE | 1473 | 241 |  101 |
    | TRUE  |  116 | 435 | 2422 |

